<?php
echo "<p> Зад.3 Да се напише метод, който по зададен масив отпечатва всички негови елементи и намира и отпечатва сумата на елементите с четен индекс. 
Да се извика метода 2 пъти за 2 различни масива</p>";

function even_number($arr){

$sum=0;
foreach ($arr as $key => $value) {
echo "$key"."-"."$value"."<br/>";

 	if ($key%2==0) {
 		$sum+=$value;		
 	}
}
echo "Сумата на елементите с четен индекс е $sum";
}
$arr=array(0=>5, 1=>6, 2=>7, 3=>8, 4=>9, 5=>12);
$arr1=array(0=>7, 1=>13, 2=>15, 3=>25, 4=>9, 5=>40);
even_number($arr);
echo "<br/>";
even_number($arr1);
?>